



// 1)
//какие типы встроенных всплывающих окон в js вы знаете?
confirm(), prompt(),alert()
// 2)
//выведите всплывающее окно с предупреждением 'Осторожно'
alert('Осторожно')
// 3)
//выведите всплывающее окно с кнопками подтверждения и отмены
confirm()

// 4)
//выведите всплывающее окно с вопросом и возможностью записать ответ
prompt()
// 5)
//какое временное событие выполняется после ожидания указанного количества миллисекунд?
setTimeout()
// 6)
//какое временное событие непрерывно повторяет выполнение функции?
setInterval()
// 7)
//выведите в консоли сообщение 'НАЧАЛО' с помощью setTimeout
 setTimeout(() => {
    alert('НАЧАЛО')
 },1000)
// 8)
//выведите в консоли сообщение 'ПОВТОР' с помощью setInterval каждые 2 секунды
setInterval(() => {
    alert('ПОВТОР')
}, 2000);
// 9)
//что такое куки?
//  данные, которые хранятся на вашем компьютере в небольших текстовых файлах.

// 10)
//как создать куки файл?
// document.cookie
// 11)
//как изменить ранее записанный куки?
// просто записать  document.cookie= 'something'
// 12)
//как удалить ранее записанный куки?

// записать параметр expires на прошлую дату

